Планы_обмена/src/Documents/Бронирования/Бронирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Бронирования</name>
  <attributes>
    <name>ТипНомера</name>
    <type>
      <types>CatalogRef.ТипыНомера</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаезда</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыезда</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗавтракВключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Постояльцы</name>
    <attributes>
      <name>Постоялец</name>
      <type>
        <types>CatalogRef.Постоялец</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Планы_обмена/src/Documents/Бронирования/ObjectModule.bsl
//@skip-check module-structure-method-in-regions
//@skip-check module-accessibility-at-client
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	НужноРегистировать = Истина;
	
	Если Не ЭтоНовый() И Не ЕстьИзменения() Тогда
		НужноРегистировать = Ложь;  
	КонецЕсли;
	
	Если НужноРегистировать Тогда
		ЗарегистироватьКОбмену();
	КонецЕсли;
		
	
КонецПроцедуры


//@skip-check module-structure-method-in-regions
//@skip-check module-accessibility-at-client
Функция ЕстьИзменения()

	Если ЭтоНовый() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбъектДоЗаписи = Ссылка.ПолучитьОбъект();
	
	Если ТипНомера <> ОбъектДоЗаписи.ТипНомера 
		ИЛИ ДатаЗаезда <> ОбъектДоЗаписи.ДатаЗаезда	
		ИЛИ ДатаВыезда <> ОбъектДоЗаписи.ДатаВыезда	
	    ИЛИ ЗавтракВключен <> ОбъектДоЗаписи.ЗавтракВключен
		ИЛИ НачалоДня(Дата) <> НачалоДня(ОбъектДоЗаписи.Дата) Тогда   
		
		Возврат Истина;
		
	КонецЕсли; 
	
	Если Постояльцы.Количество() <> ОбъектДоЗаписи.Постояльцы.Количество() Тогда
		Возврат Истина;	
	КонецЕсли; 
	
	Для Сч = 0 По Постояльцы.Количество() -1 Цикл
		Если Постояльцы[Сч].Постоялец <> ОбъектДоЗаписи.Постояльцы[Сч].Постоялец Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;	

	Возврат Ложь;
	
КонецФункции 

//@skip-check module-structure-method-in-regions
//@skip-check module-accessibility-at-client
Процедура ЗарегистироватьКОбмену()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбменМеждуСистемамиБронирования.Ссылка КАК Ссылка
	               |ИЗ
	               |	ПланОбмена.ОбменМеждуСистемамиБронирования КАК ОбменМеждуСистемамиБронирования
	               |ГДЕ
	               |	НЕ ОбменМеждуСистемамиБронирования.ЭтотУзел
	               |	И НЕ ОбменМеждуСистемамиБронирования.ПометкаУдаления";
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбменДанными.Получатели.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	
КонецПроцедуры
